// // За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10 ; i++) {
//     document.write(`<div>Java Script</div>`);
// }
//----------------------------------------------------------------------------------------------------------------------
// За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i < 10 ; i++) {
//     document.write(`<div>Java Script</div>`);
// }

// for (let i = 0; i < 10 ; i++) {
//     document.write(`<div>Block ${i}</div>`);
// }

// ---------------------------------------------------------------------------------------------------------------------

// За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let i = 0;
// while (i < 20) {
//     i++;
//     document.write(`<h1>Java Script</h1>`);
// }
//----------------------------------------------------------------------------------------------------------------------

// За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині
// let i = 0;
// while (i < 20) {
//     i++;
//     document.write(`<h1>${i} ) Java Script </h1>`);
// }


//----------------------------------------------------------------------------------------------------------------------

// Використовуючи данні з масиву, за допомоги document.write та циклу побудувати структуру по шаблону Масив:
//
//     let listOfItems = ['html', 'css', 'javascript', 'mysql', 'mongodb', 'react', 'angular', 'node.js'];
//
// ШАБЛОН:
//
//     ITEM OF ARRAY
// замість 'ITEM OF ARRAY' підставити елемент з масиву щоб получився цілий список з даними з масиву


// let listOfItems = ['html', 'css', 'javascript', 'mysql', 'mongodb', 'react', 'angular', 'node.js'];
// document.write(`<ul>`)
// for (let i = 0; i < listOfItems.length; i++) {
//     document.write(`<li>${listOfItems[i]}</li>`)
// }
// document.write(`</ul>`);

//----------------------------------------------------------------------------------------------------------------------



